app/controllers/alunos_controller.rb

  def find_all
    @alunos = Aluno.all
---
SELECT * FROM "aluno"

  def new_aluno
    @novo_aluno = Aluno.new
    @novo_aluno.nome = params[0].nome
    @novo_aluno.cpf = params[0].cpf
    @novo_aluno.data_nascimento = params[0].data_nascimento

    if @novo_aluno.save
      respond_to do |format|
        format.amf { render :amf => true }
      end
    else
      render :amf => FaultObject.new(@novo_aluno.errors.full_messages.join("\n"))
---
INSERT INTO "aluno" ("created_at", "nome", "cpf", "updated_at", "data_nascimento") VALUES('2011-07-06 18:05:03.620385', 'bruna', '8182718278', '2011-07-06 18:05:03.620385', '2011-07-04 00:00:00.000000') RETURNING "id"
SELECT "aluno".id FROM "aluno" WHERE ("aluno"."cpf" = '8372816478') LIMIT 1